app/controllers/login_controller.rb

  def authenticate
    #User.new(params[:userform]) will create a new object of User, retrieve values from the form and store it variable @user.
    @user = User.new()
    uname=params[:loginform][:user_name]
    pwd=params[:loginform][:user_pwd]

    #flash[:notice]=uname+" : "+pwd
    valid_user=nil
    valid_user = User.find(:first,:conditions => ["uname = ?",uname])
---
SELECT * FROM `users` WHERE (uname = 'admin') LIMIT 1