app/controllers/prefs_controller.rb

SELECT * FROM `users` WHERE (uname = 'admin') LIMIT 1
---
  def index
    @users = []
    if session[:username] && session[:username] == 'admin'
      @users = User.all