app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (uname = 'sam') LIMIT 1
---
  def index
    @users = []
    flash[:notice] = "UNKNOWN! "
    if session[:username] && session[:username] == 'admin'
      @users = User.all

SELECT * FROM `users` WHERE (uname = 'admin') LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (uname = 'admin') LIMIT 1
---
  def edit
    @user = User.find(:first, :conditions => ["uname = ?",session[:username]])

INSERT INTO `users` (`uname`, `address1`, `city`, `address2`, `zip`, `updated_at`, `mname`, `cell`, `dir`, `country`, `permission`, `lname`, `fname`, `pwd`, `homepage`, `phone`, `avatar`, `created`, `group`, `email`, `state`, `created_at`) VALUES('admin', '', '', '', '', '2009-06-22 17:16:32', '', '', 'global', '', '777', '', 'admin', 'skamansam', 'http://rbe.homeip.net', '', '', '2009-06-22 17:14:00', '0', 'skamansam@gmail.com', '', '2009-06-22 17:16:32')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save